FirstRoutes/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:email, :name))
        # replace the `user_attributes_here` with the actual attribute keys

        # user.save!
        # render json: user

        if user.save
---
INSERT INTO "users" ("email", "name") VALUES ($1, $2) RETURNING "id"  [["email", "abcd@yahoo.com"], ["name", "squidward"]]

    def update
        @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def destroy
        @user = User.find params[:id]
        @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]