FirstRoutes/app/controllers/users_controller.rb

    def destroy
        @user = User.find user_params[:id]
        @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]